{
  "parentUnit": "Sanguinary Priest",
  "attributes": [
    {
      "movement": 6,
      "toughness": 4,
      "save": 3,
      "wounds": 4,
      "leadership": 6,
      "objectiveControl": 1,
      "invulnerableSave": 0
    }
  ],
  "keywords": [
    "infantry",
    "character",
    "grenades",
    "imperium",
    "sanguinarypriest"
  ],
  "lore": "The Sanguinary Priests are the Blood Angels’ Apothecaries, and hold responsibility for the Chapter’s soul as well as its body. Through their ministrations and ceremonies do they call upon the Blood Angels to embrace the Red Thirst, control it and unleash their rage upon the enemy.",
  "faction_keywords": [
    "adeptus astartes",
    "blood angels"
  ],
  "abilities": {
    "core": [
      {
        "category": "core",
        "abilities": [
          "leader"
        ]
      }
    ],
    "faction": [
      {
        "category": "faction",
        "abilities": [
          "oath of moment"
        ]
      }
    ],
    "otherAbilities": [
      {
        "name": "Sanguinary Priest",
        "description": "While this model is leading a unit, models in that unit have the Feel No Pain 5+ ability. Blood Chalice: While this model is leading a unit, improve the Armour Penetration characteristic of melee weapons equipped by models in that unit by 1."
      },
      {
        "name": "1 Sanguinary Priest This model is equipped with",
        "description": "bolt pistol; Astartes chainsword. 1 model 80"
      },
      {
        "name": "This model can be attached to the following units",
        "description": "ASSAULT SQUAD DEVASTATOR SQUAD TACTICAL SQUAD VANGUARD VETERAN SQUAD You can attach this model to one of the above units, even if one CAPTAIN , CHAPTER MASTER or LIEUTENANT model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strength s. Icon of the Angel 10 Visage of Death 15 Artisan of War 20 Archangel’s Shard 25"
      }
    ]
  }
}